grevaillot/svd_tools/headers/STM32H7B3x/hrtim_common.h
#pragma once 

/* --- HRTIM_Common: High Resolution Timer: Common functions -------- */

/** @defgroup hrtim_common_registers High Resolution Timer: Common
      functions Register
@{*/

/** HRTIM_Common_CR1 Control Register 1 **/
#define HRTIM_Common_CR1			MMIO32(HRTIM_Common_BASE + 0x00)
/** HRTIM_Common_CR2 Control Register 2 **/
#define HRTIM_Common_CR2			MMIO32(HRTIM_Common_BASE + 0x04)
/** HRTIM_Common_ISR Interrupt Status Register **/
#define HRTIM_Common_ISR			MMIO32(HRTIM_Common_BASE + 0x08)
/** HRTIM_Common_ICR Interrupt Clear Register **/
#define HRTIM_Common_ICR			MMIO32(HRTIM_Common_BASE + 0x0c)
/** HRTIM_Common_IER Interrupt Enable Register **/
#define HRTIM_Common_IER			MMIO32(HRTIM_Common_BASE + 0x10)
/** HRTIM_Common_OENR Output Enable Register **/
#define HRTIM_Common_OENR			MMIO32(HRTIM_Common_BASE + 0x14)
/** HRTIM_Common_DISR DISR **/
#define HRTIM_Common_DISR			MMIO32(HRTIM_Common_BASE + 0x18)
/** HRTIM_Common_ODSR Output Disable Status Register **/
#define HRTIM_Common_ODSR			MMIO32(HRTIM_Common_BASE + 0x1c)
/** HRTIM_Common_BMCR Burst Mode Control Register **/
#define HRTIM_Common_BMCR			MMIO32(HRTIM_Common_BASE + 0x20)
/** HRTIM_Common_BMTRG BMTRG **/
#define HRTIM_Common_BMTRG			MMIO32(HRTIM_Common_BASE + 0x24)
/** HRTIM_Common_BMCMPR6 BMCMPR6 **/
#define HRTIM_Common_BMCMPR6			MMIO32(HRTIM_Common_BASE + 0x28)
/** HRTIM_Common_BMPER Burst Mode Period Register **/
#define HRTIM_Common_BMPER			MMIO32(HRTIM_Common_BASE + 0x2c)
/** HRTIM_Common_EECR1 Timer External Event Control Register 1 **/
#define HRTIM_Common_EECR1			MMIO32(HRTIM_Common_BASE + 0x30)
/** HRTIM_Common_EECR2 Timer External Event Control Register 2 **/
#define HRTIM_Common_EECR2			MMIO32(HRTIM_Common_BASE + 0x34)
/** HRTIM_Common_EECR3 Timer External Event Control Register 3 **/
#define HRTIM_Common_EECR3			MMIO32(HRTIM_Common_BASE + 0x38)
/** HRTIM_Common_ADC1R ADC Trigger 1 Register **/
#define HRTIM_Common_ADC1R			MMIO32(HRTIM_Common_BASE + 0x3c)
/** HRTIM_Common_ADC2R ADC Trigger 2 Register **/
#define HRTIM_Common_ADC2R			MMIO32(HRTIM_Common_BASE + 0x40)
/** HRTIM_Common_ADC3R ADC Trigger 3 Register **/
#define HRTIM_Common_ADC3R			MMIO32(HRTIM_Common_BASE + 0x44)
/** HRTIM_Common_ADC4R ADC Trigger 4 Register **/
#define HRTIM_Common_ADC4R			MMIO32(HRTIM_Common_BASE + 0x48)
/** HRTIM_Common_DLLCR DLL Control Register **/
#define HRTIM_Common_DLLCR			MMIO32(HRTIM_Common_BASE + 0x4c)
/** HRTIM_Common_FLTINR1 HRTIM Fault Input Register 1 **/
#define HRTIM_Common_FLTINR1			MMIO32(HRTIM_Common_BASE + 0x50)
/** HRTIM_Common_FLTINR2 HRTIM Fault Input Register 2 **/
#define HRTIM_Common_FLTINR2			MMIO32(HRTIM_Common_BASE + 0x54)
/** HRTIM_Common_BDMUPDR BDMUPDR **/
#define HRTIM_Common_BDMUPDR			MMIO32(HRTIM_Common_BASE + 0x58)
/** HRTIM_Common_BDTxUPR Burst DMA Timerx update Register **/
#define HRTIM_Common_BDTxUPR			MMIO32(HRTIM_Common_BASE + 0x5c)
/** HRTIM_Common_BDMADR Burst DMA Data Register **/
#define HRTIM_Common_BDMADR			MMIO32(HRTIM_Common_BASE + 0x60)

/**@}*/


/** @defgroup hrtim_common_cr1 CR1 Control Register 1
@{*/


#define HRTIM_Common_CR1_AD4USRC_SHIFT		25
#define HRTIM_Common_CR1_AD4USRC_MASK		0x07
/** @defgroup hrtim_common_cr1_ad4usrc AD4USRC ADC Trigger 4 Update Source
@{*/
/**@}*/


#define HRTIM_Common_CR1_AD3USRC_SHIFT		22
#define HRTIM_Common_CR1_AD3USRC_MASK		0x07
/** @defgroup hrtim_common_cr1_ad3usrc AD3USRC ADC Trigger 3 Update Source
@{*/
/**@}*/


#define HRTIM_Common_CR1_AD2USRC_SHIFT		19
#define HRTIM_Common_CR1_AD2USRC_MASK		0x07
/** @defgroup hrtim_common_cr1_ad2usrc AD2USRC ADC Trigger 2 Update Source
@{*/
/**@}*/


#define HRTIM_Common_CR1_AD1USRC_SHIFT		16
#define HRTIM_Common_CR1_AD1USRC_MASK		0x07
/** @defgroup hrtim_common_cr1_ad1usrc AD1USRC ADC Trigger 1 Update Source
@{*/
/**@}*/

/** HRTIM_Common_CR1_TEUDIS Timer E Update Disable **/
#define HRTIM_Common_CR1_TEUDIS		(1 << 5)
/** HRTIM_Common_CR1_TDUDIS Timer D Update Disable **/
#define HRTIM_Common_CR1_TDUDIS		(1 << 4)
/** HRTIM_Common_CR1_TCUDIS Timer C Update Disable **/
#define HRTIM_Common_CR1_TCUDIS		(1 << 3)
/** HRTIM_Common_CR1_TBUDIS Timer B Update Disable **/
#define HRTIM_Common_CR1_TBUDIS		(1 << 2)
/** HRTIM_Common_CR1_TAUDIS Timer A Update Disable **/
#define HRTIM_Common_CR1_TAUDIS		(1 << 1)
/** HRTIM_Common_CR1_MUDIS Master Update Disable **/
#define HRTIM_Common_CR1_MUDIS		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_cr2 CR2 Control Register 2
@{*/

/** HRTIM_Common_CR2_TERST Timer E counter software reset **/
#define HRTIM_Common_CR2_TERST		(1 << 13)
/** HRTIM_Common_CR2_TDRST Timer D counter software reset **/
#define HRTIM_Common_CR2_TDRST		(1 << 12)
/** HRTIM_Common_CR2_TCRST Timer C counter software reset **/
#define HRTIM_Common_CR2_TCRST		(1 << 11)
/** HRTIM_Common_CR2_TBRST Timer B counter software reset **/
#define HRTIM_Common_CR2_TBRST		(1 << 10)
/** HRTIM_Common_CR2_TARST Timer A counter software reset **/
#define HRTIM_Common_CR2_TARST		(1 << 9)
/** HRTIM_Common_CR2_MRST Master Counter software reset **/
#define HRTIM_Common_CR2_MRST		(1 << 8)
/** HRTIM_Common_CR2_TESWU Timer E Software Update **/
#define HRTIM_Common_CR2_TESWU		(1 << 5)
/** HRTIM_Common_CR2_TDSWU Timer D Software Update **/
#define HRTIM_Common_CR2_TDSWU		(1 << 4)
/** HRTIM_Common_CR2_TCSWU Timer C Software Update **/
#define HRTIM_Common_CR2_TCSWU		(1 << 3)
/** HRTIM_Common_CR2_TBSWU Timer B Software Update **/
#define HRTIM_Common_CR2_TBSWU		(1 << 2)
/** HRTIM_Common_CR2_TASWU Timer A Software update **/
#define HRTIM_Common_CR2_TASWU		(1 << 1)
/** HRTIM_Common_CR2_MSWU Master Timer Software update **/
#define HRTIM_Common_CR2_MSWU		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_isr ISR Interrupt Status Register
@{*/

/** HRTIM_Common_ISR_BMPER Burst mode Period Interrupt Flag **/
#define HRTIM_Common_ISR_BMPER		(1 << 17)
/** HRTIM_Common_ISR_DLLRDY DLL Ready Interrupt Flag **/
#define HRTIM_Common_ISR_DLLRDY		(1 << 16)
/** HRTIM_Common_ISR_SYSFLT System Fault Interrupt Flag **/
#define HRTIM_Common_ISR_SYSFLT		(1 << 5)
/** HRTIM_Common_ISR_FLT5 Fault 5 Interrupt Flag **/
#define HRTIM_Common_ISR_FLT5		(1 << 4)
/** HRTIM_Common_ISR_FLT4 Fault 4 Interrupt Flag **/
#define HRTIM_Common_ISR_FLT4		(1 << 3)
/** HRTIM_Common_ISR_FLT3 Fault 3 Interrupt Flag **/
#define HRTIM_Common_ISR_FLT3		(1 << 2)
/** HRTIM_Common_ISR_FLT2 Fault 2 Interrupt Flag **/
#define HRTIM_Common_ISR_FLT2		(1 << 1)
/** HRTIM_Common_ISR_FLT1 Fault 1 Interrupt Flag **/
#define HRTIM_Common_ISR_FLT1		(1 << 0)

/**@}*/

