grevaillot/svd_tools/headers/STM32H7B3x/hrtim_common.h
/** @defgroup hrtim_common_icr ICR Interrupt Clear Register
@{*/

/** HRTIM_Common_ICR_BMPERC Burst mode period flag Clear **/
#define HRTIM_Common_ICR_BMPERC		(1 << 17)
/** HRTIM_Common_ICR_DLLRDYC DLL Ready Interrupt flag Clear **/
#define HRTIM_Common_ICR_DLLRDYC		(1 << 16)
/** HRTIM_Common_ICR_SYSFLTC System Fault Interrupt Flag Clear **/
#define HRTIM_Common_ICR_SYSFLTC		(1 << 5)
/** HRTIM_Common_ICR_FLT5C Fault 5 Interrupt Flag Clear **/
#define HRTIM_Common_ICR_FLT5C		(1 << 4)
/** HRTIM_Common_ICR_FLT4C Fault 4 Interrupt Flag Clear **/
#define HRTIM_Common_ICR_FLT4C		(1 << 3)
/** HRTIM_Common_ICR_FLT3C Fault 3 Interrupt Flag Clear **/
#define HRTIM_Common_ICR_FLT3C		(1 << 2)
/** HRTIM_Common_ICR_FLT2C Fault 2 Interrupt Flag Clear **/
#define HRTIM_Common_ICR_FLT2C		(1 << 1)
/** HRTIM_Common_ICR_FLT1C Fault 1 Interrupt Flag Clear **/
#define HRTIM_Common_ICR_FLT1C		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_ier IER Interrupt Enable Register
@{*/

/** HRTIM_Common_IER_BMPERIE Burst mode period Interrupt Enable **/
#define HRTIM_Common_IER_BMPERIE		(1 << 17)
/** HRTIM_Common_IER_DLLRDYIE DLL Ready Interrupt Enable **/
#define HRTIM_Common_IER_DLLRDYIE		(1 << 16)
/** HRTIM_Common_IER_SYSFLTE System Fault Interrupt Enable **/
#define HRTIM_Common_IER_SYSFLTE		(1 << 5)
/** HRTIM_Common_IER_FLT5IE Fault 5 Interrupt Enable **/
#define HRTIM_Common_IER_FLT5IE		(1 << 4)
/** HRTIM_Common_IER_FLT4IE Fault 4 Interrupt Enable **/
#define HRTIM_Common_IER_FLT4IE		(1 << 3)
/** HRTIM_Common_IER_FLT3IE Fault 3 Interrupt Enable **/
#define HRTIM_Common_IER_FLT3IE		(1 << 2)
/** HRTIM_Common_IER_FLT2IE Fault 2 Interrupt Enable **/
#define HRTIM_Common_IER_FLT2IE		(1 << 1)
/** HRTIM_Common_IER_FLT1IE Fault 1 Interrupt Enable **/
#define HRTIM_Common_IER_FLT1IE		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_oenr OENR Output Enable Register
@{*/

/** HRTIM_Common_OENR_TE2OEN Timer E Output 2 Enable **/
#define HRTIM_Common_OENR_TE2OEN		(1 << 9)
/** HRTIM_Common_OENR_TE1OEN Timer E Output 1 Enable **/
#define HRTIM_Common_OENR_TE1OEN		(1 << 8)
/** HRTIM_Common_OENR_TD2OEN Timer D Output 2 Enable **/
#define HRTIM_Common_OENR_TD2OEN		(1 << 7)
/** HRTIM_Common_OENR_TD1OEN Timer D Output 1 Enable **/
#define HRTIM_Common_OENR_TD1OEN		(1 << 6)
/** HRTIM_Common_OENR_TC2OEN Timer C Output 2 Enable **/
#define HRTIM_Common_OENR_TC2OEN		(1 << 5)
/** HRTIM_Common_OENR_TC1OEN Timer C Output 1 Enable **/
#define HRTIM_Common_OENR_TC1OEN		(1 << 4)
/** HRTIM_Common_OENR_TB2OEN Timer B Output 2 Enable **/
#define HRTIM_Common_OENR_TB2OEN		(1 << 3)
/** HRTIM_Common_OENR_TB1OEN Timer B Output 1 Enable **/
#define HRTIM_Common_OENR_TB1OEN		(1 << 2)
/** HRTIM_Common_OENR_TA2OEN Timer A Output 2 Enable **/
#define HRTIM_Common_OENR_TA2OEN		(1 << 1)
/** HRTIM_Common_OENR_TA1OEN Timer A Output 1 Enable **/
#define HRTIM_Common_OENR_TA1OEN		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_disr DISR DISR
@{*/

/** HRTIM_Common_DISR_TE2ODIS TE2ODIS **/
#define HRTIM_Common_DISR_TE2ODIS		(1 << 9)
/** HRTIM_Common_DISR_TE1ODIS TE1ODIS **/
#define HRTIM_Common_DISR_TE1ODIS		(1 << 8)
/** HRTIM_Common_DISR_TD2ODIS TD2ODIS **/
#define HRTIM_Common_DISR_TD2ODIS		(1 << 7)
/** HRTIM_Common_DISR_TD1ODIS TD1ODIS **/
#define HRTIM_Common_DISR_TD1ODIS		(1 << 6)
/** HRTIM_Common_DISR_TC2ODIS TC2ODIS **/
#define HRTIM_Common_DISR_TC2ODIS		(1 << 5)
/** HRTIM_Common_DISR_TC1ODIS TC1ODIS **/
#define HRTIM_Common_DISR_TC1ODIS		(1 << 4)
/** HRTIM_Common_DISR_TB2ODIS TB2ODIS **/
#define HRTIM_Common_DISR_TB2ODIS		(1 << 3)
/** HRTIM_Common_DISR_TB1ODIS TB1ODIS **/
#define HRTIM_Common_DISR_TB1ODIS		(1 << 2)
/** HRTIM_Common_DISR_TA2ODIS TA2ODIS **/
#define HRTIM_Common_DISR_TA2ODIS		(1 << 1)
/** HRTIM_Common_DISR_TA1ODIS TA1ODIS **/
#define HRTIM_Common_DISR_TA1ODIS		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_odsr ODSR Output Disable Status Register
@{*/

/** HRTIM_Common_ODSR_TE2ODS Timer E Output 2 disable status **/
#define HRTIM_Common_ODSR_TE2ODS		(1 << 9)
/** HRTIM_Common_ODSR_TE1ODS Timer E Output 1 disable status **/
#define HRTIM_Common_ODSR_TE1ODS		(1 << 8)
/** HRTIM_Common_ODSR_TD2ODS Timer D Output 2 disable status **/
#define HRTIM_Common_ODSR_TD2ODS		(1 << 7)
/** HRTIM_Common_ODSR_TD1ODS Timer D Output 1 disable status **/
#define HRTIM_Common_ODSR_TD1ODS		(1 << 6)
/** HRTIM_Common_ODSR_TC2ODS Timer C Output 2 disable status **/
#define HRTIM_Common_ODSR_TC2ODS		(1 << 5)
/** HRTIM_Common_ODSR_TC1ODS Timer C Output 1 disable status **/
#define HRTIM_Common_ODSR_TC1ODS		(1 << 4)
/** HRTIM_Common_ODSR_TB2ODS Timer B Output 2 disable status **/
#define HRTIM_Common_ODSR_TB2ODS		(1 << 3)
/** HRTIM_Common_ODSR_TB1ODS Timer B Output 1 disable status **/
#define HRTIM_Common_ODSR_TB1ODS		(1 << 2)
/** HRTIM_Common_ODSR_TA2ODS Timer A Output 2 disable status **/
#define HRTIM_Common_ODSR_TA2ODS		(1 << 1)
/** HRTIM_Common_ODSR_TA1ODS Timer A Output 1 disable status **/
#define HRTIM_Common_ODSR_TA1ODS		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bmcr BMCR Burst Mode Control Register
@{*/

/** HRTIM_Common_BMCR_BMSTAT Burst Mode Status **/
#define HRTIM_Common_BMCR_BMSTAT		(1 << 31)
/** HRTIM_Common_BMCR_TEBM Timer E Burst Mode **/
#define HRTIM_Common_BMCR_TEBM		(1 << 21)
/** HRTIM_Common_BMCR_TDBM Timer D Burst Mode **/
#define HRTIM_Common_BMCR_TDBM		(1 << 20)
/** HRTIM_Common_BMCR_TCBM Timer C Burst Mode **/
#define HRTIM_Common_BMCR_TCBM		(1 << 19)
/** HRTIM_Common_BMCR_TBBM Timer B Burst Mode **/
#define HRTIM_Common_BMCR_TBBM		(1 << 18)
/** HRTIM_Common_BMCR_TABM Timer A Burst Mode **/
#define HRTIM_Common_BMCR_TABM		(1 << 17)
/** HRTIM_Common_BMCR_MTBM Master Timer Burst Mode **/
#define HRTIM_Common_BMCR_MTBM		(1 << 16)
/** HRTIM_Common_BMCR_BMPREN Burst Mode Preload Enable **/
#define HRTIM_Common_BMCR_BMPREN		(1 << 10)

#define HRTIM_Common_BMCR_BMPRSC_SHIFT		6
#define HRTIM_Common_BMCR_BMPRSC_MASK		0x0f
/** @defgroup hrtim_common_bmcr_bmprsc BMPRSC Burst Mode Prescaler
@{*/
/**@}*/


#define HRTIM_Common_BMCR_BMCLK_SHIFT		2
#define HRTIM_Common_BMCR_BMCLK_MASK		0x0f
/** @defgroup hrtim_common_bmcr_bmclk BMCLK Burst Mode Clock source
@{*/
/**@}*/

