grevaillot/svd_tools/headers/STM32H7B3x/hrtim_common.h
/** HRTIM_Common_EECR2_EE9POL External Event 9 Polarity **/
#define HRTIM_Common_EECR2_EE9POL		(1 << 20)

#define HRTIM_Common_EECR2_EE9SRC_SHIFT		18
#define HRTIM_Common_EECR2_EE9SRC_MASK		0x03
/** @defgroup hrtim_common_eecr2_ee9src EE9SRC External Event 9 Source
@{*/
/**@}*/


#define HRTIM_Common_EECR2_EE8SNS_SHIFT		15
#define HRTIM_Common_EECR2_EE8SNS_MASK		0x03
/** @defgroup hrtim_common_eecr2_ee8sns EE8SNS External Event 8 Sensitivity
@{*/
/**@}*/

/** HRTIM_Common_EECR2_EE8POL External Event 8 Polarity **/
#define HRTIM_Common_EECR2_EE8POL		(1 << 14)

#define HRTIM_Common_EECR2_EE8SRC_SHIFT		12
#define HRTIM_Common_EECR2_EE8SRC_MASK		0x03
/** @defgroup hrtim_common_eecr2_ee8src EE8SRC External Event 8 Source
@{*/
/**@}*/


#define HRTIM_Common_EECR2_EE7SNS_SHIFT		9
#define HRTIM_Common_EECR2_EE7SNS_MASK		0x03
/** @defgroup hrtim_common_eecr2_ee7sns EE7SNS External Event 7 Sensitivity
@{*/
/**@}*/

/** HRTIM_Common_EECR2_EE7POL External Event 7 Polarity **/
#define HRTIM_Common_EECR2_EE7POL		(1 << 8)

#define HRTIM_Common_EECR2_EE7SRC_SHIFT		6
#define HRTIM_Common_EECR2_EE7SRC_MASK		0x03
/** @defgroup hrtim_common_eecr2_ee7src EE7SRC External Event 7 Source
@{*/
/**@}*/


#define HRTIM_Common_EECR2_EE6SNS_SHIFT		3
#define HRTIM_Common_EECR2_EE6SNS_MASK		0x03
/** @defgroup hrtim_common_eecr2_ee6sns EE6SNS External Event 6 Sensitivity
@{*/
/**@}*/

/** HRTIM_Common_EECR2_EE6POL External Event 6 Polarity **/
#define HRTIM_Common_EECR2_EE6POL		(1 << 2)

#define HRTIM_Common_EECR2_EE6SRC_SHIFT		0
#define HRTIM_Common_EECR2_EE6SRC_MASK		0x03
/** @defgroup hrtim_common_eecr2_ee6src EE6SRC External Event 6 Source
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_common_eecr3 EECR3 Timer External Event Control Register 3
@{*/


#define HRTIM_Common_EECR3_EE10SNS_SHIFT		27
#define HRTIM_Common_EECR3_EE10SNS_MASK		0x03
/** @defgroup hrtim_common_eecr3_ee10sns EE10SNS EE10SNS
@{*/
/**@}*/

/** HRTIM_Common_EECR3_EE10POL EE10POL **/
#define HRTIM_Common_EECR3_EE10POL		(1 << 26)

#define HRTIM_Common_EECR3_EE10SRC_SHIFT		24
#define HRTIM_Common_EECR3_EE10SRC_MASK		0x03
/** @defgroup hrtim_common_eecr3_ee10src EE10SRC EE10SRC
@{*/
/**@}*/


#define HRTIM_Common_EECR3_EE9SNS_SHIFT		21
#define HRTIM_Common_EECR3_EE9SNS_MASK		0x03
/** @defgroup hrtim_common_eecr3_ee9sns EE9SNS EE9SNS
@{*/
/**@}*/

/** HRTIM_Common_EECR3_EE9POL EE9POL **/
#define HRTIM_Common_EECR3_EE9POL		(1 << 20)

#define HRTIM_Common_EECR3_EE9SRC_SHIFT		18
#define HRTIM_Common_EECR3_EE9SRC_MASK		0x03
/** @defgroup hrtim_common_eecr3_ee9src EE9SRC EE9SRC
@{*/
/**@}*/


#define HRTIM_Common_EECR3_EE8SNS_SHIFT		15
#define HRTIM_Common_EECR3_EE8SNS_MASK		0x03
/** @defgroup hrtim_common_eecr3_ee8sns EE8SNS EE8SNS
@{*/
/**@}*/

/** HRTIM_Common_EECR3_EE8POL EE8POL **/
#define HRTIM_Common_EECR3_EE8POL		(1 << 14)

#define HRTIM_Common_EECR3_EE8SRC_SHIFT		12
#define HRTIM_Common_EECR3_EE8SRC_MASK		0x03
/** @defgroup hrtim_common_eecr3_ee8src EE8SRC EE8SRC
@{*/
/**@}*/


#define HRTIM_Common_EECR3_EE7SNS_SHIFT		9
#define HRTIM_Common_EECR3_EE7SNS_MASK		0x03
/** @defgroup hrtim_common_eecr3_ee7sns EE7SNS EE7SNS
@{*/
/**@}*/

/** HRTIM_Common_EECR3_EE7POL EE7POL **/
#define HRTIM_Common_EECR3_EE7POL		(1 << 8)

#define HRTIM_Common_EECR3_EE7SRC_SHIFT		6
#define HRTIM_Common_EECR3_EE7SRC_MASK		0x03
/** @defgroup hrtim_common_eecr3_ee7src EE7SRC EE7SRC
@{*/
/**@}*/


#define HRTIM_Common_EECR3_EE6SNS_SHIFT		3
#define HRTIM_Common_EECR3_EE6SNS_MASK		0x03
/** @defgroup hrtim_common_eecr3_ee6sns EE6SNS EE6SNS
@{*/
/**@}*/

/** HRTIM_Common_EECR3_EE6POL EE6POL **/
#define HRTIM_Common_EECR3_EE6POL		(1 << 2)

#define HRTIM_Common_EECR3_EE6SRC_SHIFT		0
#define HRTIM_Common_EECR3_EE6SRC_MASK		0x03
/** @defgroup hrtim_common_eecr3_ee6src EE6SRC EE6SRC
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_common_adc1r ADC1R ADC Trigger 1 Register
@{*/

/** HRTIM_Common_ADC1R_AD1TEPER ADC trigger 1 on Timer E Period **/
#define HRTIM_Common_ADC1R_AD1TEPER		(1 << 31)
/** HRTIM_Common_ADC1R_AD1TEC4 ADC trigger 1 on Timer E compare 4 **/
#define HRTIM_Common_ADC1R_AD1TEC4		(1 << 30)
/** HRTIM_Common_ADC1R_AD1TEC3 ADC trigger 1 on Timer E compare 3 **/
#define HRTIM_Common_ADC1R_AD1TEC3		(1 << 29)
/** HRTIM_Common_ADC1R_AD1TEC2 ADC trigger 1 on Timer E compare 2 **/
#define HRTIM_Common_ADC1R_AD1TEC2		(1 << 28)
/** HRTIM_Common_ADC1R_AD1TDPER ADC trigger 1 on Timer D Period **/
#define HRTIM_Common_ADC1R_AD1TDPER		(1 << 27)
/** HRTIM_Common_ADC1R_AD1TDC4 ADC trigger 1 on Timer D compare 4 **/
#define HRTIM_Common_ADC1R_AD1TDC4		(1 << 26)
/** HRTIM_Common_ADC1R_AD1TDC3 ADC trigger 1 on Timer D compare 3 **/
#define HRTIM_Common_ADC1R_AD1TDC3		(1 << 25)
/** HRTIM_Common_ADC1R_AD1TDC2 ADC trigger 1 on Timer D compare 2 **/
#define HRTIM_Common_ADC1R_AD1TDC2		(1 << 24)
/** HRTIM_Common_ADC1R_AD1TCPER ADC trigger 1 on Timer C Period **/
#define HRTIM_Common_ADC1R_AD1TCPER		(1 << 23)
/** HRTIM_Common_ADC1R_AD1TCC4 ADC trigger 1 on Timer C compare 4 **/
#define HRTIM_Common_ADC1R_AD1TCC4		(1 << 22)
/** HRTIM_Common_ADC1R_AD1TCC3 ADC trigger 1 on Timer C compare 3 **/
#define HRTIM_Common_ADC1R_AD1TCC3		(1 << 21)
/** HRTIM_Common_ADC1R_AD1TCC2 ADC trigger 1 on Timer C compare 2 **/
#define HRTIM_Common_ADC1R_AD1TCC2		(1 << 20)
/** HRTIM_Common_ADC1R_AD1TBRST ADC trigger 1 on Timer B Reset **/
#define HRTIM_Common_ADC1R_AD1TBRST		(1 << 19)
/** HRTIM_Common_ADC1R_AD1TBPER ADC trigger 1 on Timer B Period **/
#define HRTIM_Common_ADC1R_AD1TBPER		(1 << 18)
/** HRTIM_Common_ADC1R_AD1TBC4 ADC trigger 1 on Timer B compare 4 **/
#define HRTIM_Common_ADC1R_AD1TBC4		(1 << 17)
/** HRTIM_Common_ADC1R_AD1TBC3 ADC trigger 1 on Timer B compare 3 **/
#define HRTIM_Common_ADC1R_AD1TBC3		(1 << 16)
/** HRTIM_Common_ADC1R_AD1TBC2 ADC trigger 1 on Timer B compare 2 **/
#define HRTIM_Common_ADC1R_AD1TBC2		(1 << 15)
/** HRTIM_Common_ADC1R_AD1TARST ADC trigger 1 on Timer A Reset **/
#define HRTIM_Common_ADC1R_AD1TARST		(1 << 14)
/** HRTIM_Common_ADC1R_AD1TAPER ADC trigger 1 on Timer A Period **/
#define HRTIM_Common_ADC1R_AD1TAPER		(1 << 13)
/** HRTIM_Common_ADC1R_AD1TAC4 ADC trigger 1 on Timer A compare 4 **/
#define HRTIM_Common_ADC1R_AD1TAC4		(1 << 12)
/** HRTIM_Common_ADC1R_AD1TAC3 ADC trigger 1 on Timer A compare 3 **/
#define HRTIM_Common_ADC1R_AD1TAC3		(1 << 11)
/** HRTIM_Common_ADC1R_AD1TAC2 ADC trigger 1 on Timer A compare 2 **/
#define HRTIM_Common_ADC1R_AD1TAC2		(1 << 10)
/** HRTIM_Common_ADC1R_AD1EEV5 ADC trigger 1 on External Event 5 **/
#define HRTIM_Common_ADC1R_AD1EEV5		(1 << 9)
/** HRTIM_Common_ADC1R_AD1EEV4 ADC trigger 1 on External Event 4 **/
#define HRTIM_Common_ADC1R_AD1EEV4		(1 << 8)
/** HRTIM_Common_ADC1R_AD1EEV3 ADC trigger 1 on External Event 3 **/
#define HRTIM_Common_ADC1R_AD1EEV3		(1 << 7)
/** HRTIM_Common_ADC1R_AD1EEV2 ADC trigger 1 on External Event 2 **/
#define HRTIM_Common_ADC1R_AD1EEV2		(1 << 6)
/** HRTIM_Common_ADC1R_AD1EEV1 ADC trigger 1 on External Event 1 **/
#define HRTIM_Common_ADC1R_AD1EEV1		(1 << 5)
/** HRTIM_Common_ADC1R_AD1MPER ADC trigger 1 on Master Period **/
#define HRTIM_Common_ADC1R_AD1MPER		(1 << 4)
/** HRTIM_Common_ADC1R_AD1MC4 ADC trigger 1 on Master Compare 4 **/
#define HRTIM_Common_ADC1R_AD1MC4		(1 << 3)
/** HRTIM_Common_ADC1R_AD1MC3 ADC trigger 1 on Master Compare 3 **/
#define HRTIM_Common_ADC1R_AD1MC3		(1 << 2)
/** HRTIM_Common_ADC1R_AD1MC2 ADC trigger 1 on Master Compare 2 **/
#define HRTIM_Common_ADC1R_AD1MC2		(1 << 1)
/** HRTIM_Common_ADC1R_AD1MC1 ADC trigger 1 on Master Compare 1 **/
#define HRTIM_Common_ADC1R_AD1MC1		(1 << 0)

/**@}*/

