grevaillot/svd_tools/headers/STM32H7B3x/hrtim_common.h
/** HRTIM_Common_FLTINR1_FLT4SRC FLT4SRC **/
#define HRTIM_Common_FLTINR1_FLT4SRC		(1 << 26)
/** HRTIM_Common_FLTINR1_FLT4P FLT4P **/
#define HRTIM_Common_FLTINR1_FLT4P		(1 << 25)
/** HRTIM_Common_FLTINR1_FLT4E FLT4E **/
#define HRTIM_Common_FLTINR1_FLT4E		(1 << 24)
/** HRTIM_Common_FLTINR1_FLT3LCK FLT3LCK **/
#define HRTIM_Common_FLTINR1_FLT3LCK		(1 << 23)

#define HRTIM_Common_FLTINR1_FLT3F_SHIFT		19
#define HRTIM_Common_FLTINR1_FLT3F_MASK		0x0f
/** @defgroup hrtim_common_fltinr1_flt3f FLT3F FLT3F
@{*/
/**@}*/

/** HRTIM_Common_FLTINR1_FLT3SRC FLT3SRC **/
#define HRTIM_Common_FLTINR1_FLT3SRC		(1 << 18)
/** HRTIM_Common_FLTINR1_FLT3P FLT3P **/
#define HRTIM_Common_FLTINR1_FLT3P		(1 << 17)
/** HRTIM_Common_FLTINR1_FLT3E FLT3E **/
#define HRTIM_Common_FLTINR1_FLT3E		(1 << 16)
/** HRTIM_Common_FLTINR1_FLT2LCK FLT2LCK **/
#define HRTIM_Common_FLTINR1_FLT2LCK		(1 << 15)

#define HRTIM_Common_FLTINR1_FLT2F_SHIFT		11
#define HRTIM_Common_FLTINR1_FLT2F_MASK		0x0f
/** @defgroup hrtim_common_fltinr1_flt2f FLT2F FLT2F
@{*/
/**@}*/

/** HRTIM_Common_FLTINR1_FLT2SRC FLT2SRC **/
#define HRTIM_Common_FLTINR1_FLT2SRC		(1 << 10)
/** HRTIM_Common_FLTINR1_FLT2P FLT2P **/
#define HRTIM_Common_FLTINR1_FLT2P		(1 << 9)
/** HRTIM_Common_FLTINR1_FLT2E FLT2E **/
#define HRTIM_Common_FLTINR1_FLT2E		(1 << 8)
/** HRTIM_Common_FLTINR1_FLT1LCK FLT1LCK **/
#define HRTIM_Common_FLTINR1_FLT1LCK		(1 << 7)

#define HRTIM_Common_FLTINR1_FLT1F_SHIFT		3
#define HRTIM_Common_FLTINR1_FLT1F_MASK		0x0f
/** @defgroup hrtim_common_fltinr1_flt1f FLT1F FLT1F
@{*/
/**@}*/

/** HRTIM_Common_FLTINR1_FLT1SRC FLT1SRC **/
#define HRTIM_Common_FLTINR1_FLT1SRC		(1 << 2)
/** HRTIM_Common_FLTINR1_FLT1P FLT1P **/
#define HRTIM_Common_FLTINR1_FLT1P		(1 << 1)
/** HRTIM_Common_FLTINR1_FLT1E FLT1E **/
#define HRTIM_Common_FLTINR1_FLT1E		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_fltinr2 FLTINR2 HRTIM Fault Input Register 2
@{*/


#define HRTIM_Common_FLTINR2_FLTSD_SHIFT		24
#define HRTIM_Common_FLTINR2_FLTSD_MASK		0x03
/** @defgroup hrtim_common_fltinr2_fltsd FLTSD FLTSD
@{*/
/**@}*/

/** HRTIM_Common_FLTINR2_FLT5LCK FLT5LCK **/
#define HRTIM_Common_FLTINR2_FLT5LCK		(1 << 7)

#define HRTIM_Common_FLTINR2_FLT5F_SHIFT		3
#define HRTIM_Common_FLTINR2_FLT5F_MASK		0x0f
/** @defgroup hrtim_common_fltinr2_flt5f FLT5F FLT5F
@{*/
/**@}*/

/** HRTIM_Common_FLTINR2_FLT5SRC FLT5SRC **/
#define HRTIM_Common_FLTINR2_FLT5SRC		(1 << 2)
/** HRTIM_Common_FLTINR2_FLT5P FLT5P **/
#define HRTIM_Common_FLTINR2_FLT5P		(1 << 1)
/** HRTIM_Common_FLTINR2_FLT5E FLT5E **/
#define HRTIM_Common_FLTINR2_FLT5E		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bdmupdr BDMUPDR BDMUPDR
@{*/

/** HRTIM_Common_BDMUPDR_MCMP4 MCMP4 **/
#define HRTIM_Common_BDMUPDR_MCMP4		(1 << 9)
/** HRTIM_Common_BDMUPDR_MCMP3 MCMP3 **/
#define HRTIM_Common_BDMUPDR_MCMP3		(1 << 8)
/** HRTIM_Common_BDMUPDR_MCMP2 MCMP2 **/
#define HRTIM_Common_BDMUPDR_MCMP2		(1 << 7)
/** HRTIM_Common_BDMUPDR_MCMP1 MCMP1 **/
#define HRTIM_Common_BDMUPDR_MCMP1		(1 << 6)
/** HRTIM_Common_BDMUPDR_MREP MREP **/
#define HRTIM_Common_BDMUPDR_MREP		(1 << 5)
/** HRTIM_Common_BDMUPDR_MPER MPER **/
#define HRTIM_Common_BDMUPDR_MPER		(1 << 4)
/** HRTIM_Common_BDMUPDR_MCNT MCNT **/
#define HRTIM_Common_BDMUPDR_MCNT		(1 << 3)
/** HRTIM_Common_BDMUPDR_MDIER MDIER **/
#define HRTIM_Common_BDMUPDR_MDIER		(1 << 2)
/** HRTIM_Common_BDMUPDR_MICR MICR **/
#define HRTIM_Common_BDMUPDR_MICR		(1 << 1)
/** HRTIM_Common_BDMUPDR_MCR MCR **/
#define HRTIM_Common_BDMUPDR_MCR		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bdtxupr BDTxUPR Burst DMA Timerx update Register
@{*/

/** HRTIM_Common_BDTxUPR_TIMxFLTR HRTIM_FLTxR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxFLTR		(1 << 20)
/** HRTIM_Common_BDTxUPR_TIMxOUTR HRTIM_OUTxR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxOUTR		(1 << 19)
/** HRTIM_Common_BDTxUPR_TIMxCHPR HRTIM_CHPxR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxCHPR		(1 << 18)
/** HRTIM_Common_BDTxUPR_TIMxRSTR HRTIM_RSTxR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxRSTR		(1 << 17)
/** HRTIM_Common_BDTxUPR_TIMxEEFR2 HRTIM_EEFxR2 register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxEEFR2		(1 << 16)
/** HRTIM_Common_BDTxUPR_TIMxEEFR1 HRTIM_EEFxR1 register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxEEFR1		(1 << 15)
/** HRTIM_Common_BDTxUPR_TIMxRST2R HRTIM_RST2xR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxRST2R		(1 << 14)
/** HRTIM_Common_BDTxUPR_TIMxSET2R HRTIM_SET2xR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxSET2R		(1 << 13)
/** HRTIM_Common_BDTxUPR_TIMxRST1R HRTIM_RST1xR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxRST1R		(1 << 12)
/** HRTIM_Common_BDTxUPR_TIMxSET1R HRTIM_SET1xR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxSET1R		(1 << 11)
/** HRTIM_Common_BDTxUPR_TIMx_DTxR HRTIM_DTxR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMx_DTxR		(1 << 10)
/** HRTIM_Common_BDTxUPR_TIMxCMP4 HRTIM_CMP4xR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxCMP4		(1 << 9)
/** HRTIM_Common_BDTxUPR_TIMxCMP3 HRTIM_CMP3xR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxCMP3		(1 << 8)
/** HRTIM_Common_BDTxUPR_TIMxCMP2 HRTIM_CMP2xR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxCMP2		(1 << 7)
/** HRTIM_Common_BDTxUPR_TIMxCMP1 HRTIM_CMP1xR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxCMP1		(1 << 6)
/** HRTIM_Common_BDTxUPR_TIMxREP HRTIM_REPxR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxREP		(1 << 5)
/** HRTIM_Common_BDTxUPR_TIMxPER HRTIM_PERxR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxPER		(1 << 4)
/** HRTIM_Common_BDTxUPR_TIMxCNT HRTIM_CNTxR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxCNT		(1 << 3)
/** HRTIM_Common_BDTxUPR_TIMxDIER HRTIM_TIMxDIER register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxDIER		(1 << 2)
/** HRTIM_Common_BDTxUPR_TIMxICR HRTIM_TIMxICR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxICR		(1 << 1)
/** HRTIM_Common_BDTxUPR_TIMxCR HRTIM_TIMxCR register update enable **/
#define HRTIM_Common_BDTxUPR_TIMxCR		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bdmadr BDMADR Burst DMA Data Register
@{*/


#define HRTIM_Common_BDMADR_BDMADR_SHIFT		0
#define HRTIM_Common_BDMADR_BDMADR_MASK		0xffffffff
/** @defgroup hrtim_common_bdmadr_bdmadr BDMADR Burst DMA Data register
@{*/
/**@}*/


/**@}*/
